# StructuralConnectionTooFarRefs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionTooFarRefs Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Structural Connection Handler cannot connect too far elements
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionTooFarRefs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionTooFarRefs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionTooFarRefs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace